Iremos ver como converter tipo de dados!

In [5]:
import pandas as pd

# Lendo o arquivo Excel
df = pd.read_excel("../Dataset/Dataset.xlsx")

# Exibindo as primeiras linhas do dataset para verificar
df.head()

,UUID,IDCustomer,DTTransaction,Points
0,c00f1564-9f29-4e3a-b7d9-f20161e45a7f,dcta462j-313l-515fm-t6gh-6424er7845m2,2024-06-06 21:54:36,1577
1,cfd9ac73-6e80-4c17-8b59-d12bf7a22c7c,dcta849j-801l-228fm-t6gh-8918er7845m2,2024-07-08 21:19:36,394
2,54a23192-aabf-4937-8e8f-f8e65ca7059f,dcta880j-668l-412fm-t6gh-7273er7845m2,2024-01-27 14:03:36,55
3,0a7b7d6c-e1a4-4535-8041-655a80c598e5,dcta564j-790l-786fm-t6gh-1924er7845m2,2024-07-22 16:20:36,460
4,659f6f6c-d6c5-4bec-8ac2-2a3612d0e75c,dcta838j-174l-151fm-t6gh-3006er7845m2,2024-08-29 21:53:36,854

In [6]:
df.dtypes

UUID                     object
IDCustomer               object
DTTransaction    datetime64[ns]
Points                    int64
dtype: object

In [7]:
df['Points_dobble'] = df['Points'] * 2

In [12]:
df[['Points_dobble', 'Points']].astype(float)

    Points_dobble  Points
0          3154.0  1577.0
1           788.0   394.0
2           110.0    55.0
3           920.0   460.0
4          1708.0   854.0
..            ...     ...
95           32.0    16.0
96          542.0   271.0
97          148.0    74.0
98          880.0   440.0
99         1660.0   830.0

[100 rows x 2 columns]